logs/fio/mdev/4S3F/4KRandW12_s4_q4_1_v0_mdev.log
randw-4K-n1-c1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
randw-4K-n2-c2: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n4-c4: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n8-c8: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n12-c12: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

randw-4K-n1-c1: (groupid=0, jobs=1): err= 0: pid=3507: Sat Jul 27 22:59:30 2019
  write: IOPS=121k, BW=474MiB/s (498MB/s)(55.6GiB/120001msec)
    slat (usec): min=2, max=136, avg= 2.97, stdev= 1.62
    clat (usec): min=21, max=733, avg=256.80, stdev=14.89
     lat (usec): min=24, max=741, avg=260.33, stdev=15.07
    clat percentiles (usec):
     | 10.000th=[  247], 20.000th=[  249], 30.000th=[  251], 40.000th=[  253],
     | 50.000th=[  253], 70.000th=[  255], 90.000th=[  269], 99.000th=[  314],
     | 99.900th=[  343], 99.990th=[  371], 99.999th=[  644]
   bw (  KiB/s): min=374454, max=481451, per=77.95%, avg=378737.31, stdev=6772.57, samples=239
   iops        : min=93613, max=120364, avg=94683.98, stdev=1693.24, samples=239
  lat (usec)   : 50=0.01%, 100=0.01%, 250=23.55%, 500=76.44%, 750=0.01%
  cpu          : usr=51.84%, sys=48.16%, ctx=412, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,14575696,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n2-c2: (groupid=1, jobs=2): err= 0: pid=3513: Sat Jul 27 22:59:30 2019
  write: IOPS=186k, BW=727MiB/s (762MB/s)(85.2GiB/120018msec)
    slat (usec): min=2, max=27859, avg= 3.71, stdev= 6.78
    clat (usec): min=62, max=28521, avg=337.19, stdev=64.17
     lat (usec): min=214, max=28526, avg=341.48, stdev=64.45
    clat percentiles (usec):
     | 10.000th=[  293], 20.000th=[  297], 30.000th=[  318], 40.000th=[  326],
     | 50.000th=[  330], 70.000th=[  359], 90.000th=[  392], 99.000th=[  441],
     | 99.900th=[  486], 99.990th=[  676], 99.999th=[  881]
   bw (  KiB/s): min=283004, max=447653, per=39.10%, avg=291034.23, stdev=11221.23, samples=478
   iops        : min=70751, max=111913, avg=72758.21, stdev=2805.30, samples=478
  lat (usec)   : 100=0.01%, 250=0.63%, 500=99.32%, 750=0.05%, 1000=0.01%
  lat (msec)   : 20=0.01%, 50=0.01%
  cpu          : usr=36.18%, sys=45.36%, ctx=5280739, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,22334174,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n4-c4: (groupid=2, jobs=4): err= 0: pid=3518: Sat Jul 27 22:59:30 2019
  write: IOPS=234k, BW=915MiB/s (960MB/s)(107GiB/120016msec)
    slat (usec): min=2, max=19715, avg= 3.34, stdev= 6.79
    clat (usec): min=94, max=21068, avg=539.99, stdev=80.44
     lat (usec): min=225, max=21072, avg=543.94, stdev=80.57
    clat percentiles (usec):
     | 10.000th=[  449], 20.000th=[  490], 30.000th=[  510], 40.000th=[  529],
     | 50.000th=[  537], 70.000th=[  570], 90.000th=[  619], 99.000th=[  685],
     | 99.900th=[  750], 99.990th=[ 1156], 99.999th=[ 2802]
   bw (  KiB/s): min=202906, max=354040, per=23.33%, avg=218678.63, stdev=19558.32, samples=956
   iops        : min=50726, max=88510, avg=54669.28, stdev=4889.57, samples=956
  lat (usec)   : 100=0.01%, 250=0.01%, 500=26.38%, 750=73.52%, 1000=0.07%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=26.79%, sys=35.25%, ctx=23362235, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,28126115,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n8-c8: (groupid=3, jobs=8): err= 0: pid=3525: Sat Jul 27 22:59:30 2019
  write: IOPS=186k, BW=727MiB/s (762MB/s)(85.2GiB/120013msec)
    slat (usec): min=2, max=18315, avg= 4.39, stdev= 8.59
    clat (usec): min=96, max=21352, avg=1367.73, stdev=215.90
     lat (usec): min=171, max=21356, avg=1372.86, stdev=216.18
    clat percentiles (usec):
     | 10.000th=[ 1270], 20.000th=[ 1303], 30.000th=[ 1336], 40.000th=[ 1352],
     | 50.000th=[ 1369], 70.000th=[ 1418], 90.000th=[ 1483], 99.000th=[ 2114],
     | 99.900th=[ 2245], 99.990th=[ 2343], 99.999th=[ 8225]
   bw (  KiB/s): min=43416, max=228885, per=8.92%, avg=66368.44, stdev=11461.97, samples=1912
   iops        : min=10854, max=57221, avg=16591.73, stdev=2865.49, samples=1912
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.18%, 750=3.46%, 1000=0.78%
  lat (msec)   : 2=92.73%, 4=2.86%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=13.13%, sys=17.82%, ctx=18861973, majf=0, minf=91
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,22331338,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n12-c12: (groupid=4, jobs=12): err= 0: pid=3536: Sat Jul 27 22:59:30 2019
  write: IOPS=187k, BW=731MiB/s (767MB/s)(85.7GiB/120019msec)
    slat (usec): min=2, max=16360, avg= 6.20, stdev= 6.11
    clat (usec): min=116, max=20578, avg=2040.36, stdev=222.26
     lat (usec): min=238, max=20586, avg=2047.60, stdev=222.37
    clat percentiles (usec):
     | 10.000th=[ 1909], 20.000th=[ 1958], 30.000th=[ 1991], 40.000th=[ 2024],
     | 50.000th=[ 2040], 70.000th=[ 2089], 90.000th=[ 2180], 99.000th=[ 2802],
     | 99.900th=[ 2966], 99.990th=[ 3589], 99.999th=[ 6063]
   bw (  KiB/s): min=46336, max=94511, per=8.35%, avg=62513.18, stdev=6189.02, samples=2880
   iops        : min=11584, max=23627, avg=15628.12, stdev=1547.24, samples=2880
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=33.87%, 4=66.11%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=11.70%, sys=14.77%, ctx=11849982, majf=0, minf=128
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,22460078,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=474MiB/s (498MB/s), 474MiB/s-474MiB/s (498MB/s-498MB/s), io=55.6GiB (59.7GB), run=120001-120001msec

Run status group 1 (all jobs):
  WRITE: bw=727MiB/s (762MB/s), 727MiB/s-727MiB/s (762MB/s-762MB/s), io=85.2GiB (91.5GB), run=120018-120018msec

Run status group 2 (all jobs):
  WRITE: bw=915MiB/s (960MB/s), 915MiB/s-915MiB/s (960MB/s-960MB/s), io=107GiB (115GB), run=120016-120016msec

Run status group 3 (all jobs):
  WRITE: bw=727MiB/s (762MB/s), 727MiB/s-727MiB/s (762MB/s-762MB/s), io=85.2GiB (91.5GB), run=120013-120013msec

Run status group 4 (all jobs):
  WRITE: bw=731MiB/s (767MB/s), 731MiB/s-731MiB/s (767MB/s-767MB/s), io=85.7GiB (91.0GB), run=120019-120019msec

Disk stats (read/write):
  nvme0n1: ios=365/109808159, merge=0/0, ticks=20/98026776, in_queue=98294584, util=89.94%